title: Active Directory - Privileged Access Detection (SecretDump, DCSync)
id: ad_privileged_access_detection
status: experimental
author: Ian
description: Detects scenarios where an attacker attempts to extract sensitive information from Active Directory using SecretDump, DCSync, or Mimikatz.
date: 2023-12-22
references:
  - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/
  - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/dump-password-hashes-from-domain-controller-with-dcsync
  - https://attack.stealthbits.com/privilege-escalation-using-mimikatz-dcsync
  - https://blog.fox-it.com/2018/04/26/escalating-privileges-with-acls-in-active-directory/
  - https://simondotsh.com/infosec/2022/07/11/dirsync.html
  - https://www.logpoint.com/en/blog/compromises-in-azure-ad-through-aad-connect/
logsource:
  category: directory-service
  product: windows
detection:
  selection:
    EventID:
      - 4662
    AccessMask: "0x100"
    Properties|contains:
      - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
      - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
      - '89e95b76-444d-4c62-991a-0facbeda640c'
  filter:
    AccountName|endswith: '$'
  timeframe: 30m
  condition: selection and not filter
level: high
tags:
  - attack.credential_access
  - attack.t1003.006
falsepositives:
  - Legitimate administrative actions accessing AD attributes.
  - Service accounts performing authorized operations.
mitre:
  - Tactic: Credential Access
  - Technique: DCSync (T1003.006)
fields:
  - EventID
  - Properties
  - AccountName
  - ComputerName

