title: Detect AD DPAPI Attribute Access (DCSync, Mimikatz, RiskySPN)
id: ad_dpapi_access
status: experimental
author: Ian
description: Detects attempts to extract sensitive DPAPI information from Active Directory using RiskySPN, DCSync, or Mimikatz.
date: 2023-12-22
references:
  - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
  - https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights
  - https://github.com/PSGumshoe/PSGumshoe/blob/master/DirectoryService/PrivateFunctions.ps1
  - https://stealthbits.com/blog/detecting-persistence-through-active-directory-extended-rights/
  - https://cqureacademy.com/blog/extracting-roamed-private-keys
  - https://www.harmj0y.net/blog/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/
  - https://www.mandiant.com/resources/blog/apt29-windows-credential-roaming
  - https://www.dsinternals.com/en/retrieving-dpapi-backup-keys-from-active-directory/
logsource:
  category: directory-service
  product: windows
detection:
  selection:
    EventID:
      - 4662
    Properties|contains:
      - '612cb747-c0e8-4f92-9221-fdd5f15b550d'
      - '6617e4ac-a2f1-43ab-b60c-11fbd1facf05'
      - 'b3f93023-9239-4f7c-b99c-6745d87adbc2'
      - 'b7ff5a38-0818-42b0-8110-d3d154c97f24'
      - 'b8dfa744-31dc-4ef1-ac7c-84baf7ef9da7'
  filter:
    AccountName|endswith: '$'
  timeframe: 30m
  condition: selection and not filter
level: high
tags:
  - attack.credential_access
  - attack.t1555.004
falsepositives:
  - Legitimate administrative actions accessing DPAPI-related attributes.
  - Service accounts performing authorized operations.
mitre:
  - Tactic: Credential Access
  - Technique: Windows Credential Manager (T1555.004)
fields:
  - EventID
  - Properties
  - AccountName
  - ComputerName
